In [1]:
#List of highschools
high_schools = ["Hernandez High School", "Figueroa High School", "Wilson High School", "Wright High School"]

In [2]:
for school in high_schools:
    print(school)

Hernandez High School
Figueroa High School
Wilson High School
Wright High School

In [3]:
#A dictionary of high schools and the type of school.
high_school_types = [{"High School": "Griffin", "Type":"District"},
                     {"High School": "Figeuroa", "Type:":"District"},
                     {"High School": "Wilson", "Type:":"Charter"},
                     {"High School": "Wright", "Type:":"Charter"}]

In [4]:
# A dictionary of high schools 
high_schools_dicts = [{"School ID": 0, "school_name": "Huang High School", "type": "District"},
                       {"School ID": 1, "school_name": "Figueroa High School", "type": "District"},
                        {"School ID": 2, "school_name": "Shelton High School", "type": "Charter"},
                         {"School ID": 3, "school_name": "Hernandez High School", "type": "District"},
                          {"School ID": 4, "school_name": "Griffin High School", "type": "Charter"}]

In [5]:
# List of high schools
high_schools = ["Huan High School", "Figueroa High School", "Shelton High School", "Hernandez High School", "Griffin High School"
                , "Wilson High School", "Cabrera High School", "Bailey High School", "Holden High School", "Pena High School", 
                "Wright High School", "Rodriguez High School", "Johnson High School", "Ford High School", "Thomas High School"]

In [6]:
print(high_schools)

['Huan High School', 'Figueroa High School', 'Shelton High School', 'Hernandez High School', 'Griffin High School', 'Wilson High School', 'Cabrera High School', 'Bailey High School', 'Holden High School', 'Pena High School', 'Wright High School', 'Rodriguez High School', 'Johnson High School', 'Ford High School', 'Thomas High School']

In [7]:
#Add the Pandas dependency
import pandas as pd

In [8]:
#Create a Pandas Series from a list
school_series = pd.Series(high_schools)

In [9]:
school_df = pd.DataFrame(high_schools_dicts)
school_df

   School ID            school_name      type
0          0      Huang High School  District
1          1   Figueroa High School  District
2          2    Shelton High School   Charter
3          3  Hernandez High School  District
4          4    Griffin High School   Charter

In [10]:
#Create a Pandas Series from a list
# this will convert the array or list of dictionaries to a DataFrame
school_series = pd.Series(high_schools)
school_series

0          Huan High School
1      Figueroa High School
2       Shelton High School
3     Hernandez High School
4       Griffin High School
5        Wilson High School
6       Cabrera High School
7        Bailey High School
8        Holden High School
9          Pena High School
10       Wright High School
11    Rodriguez High School
12      Johnson High School
13         Ford High School
14       Thomas High School
dtype: object

In [11]:
#Three seperate lists of information on high schools
#We can also create DF by adding each column as list to an empty DF
school_id = [0, 1, 2, 3, 4]

school_name = ["Huang High School", "Figueroa High School",
               "Shelton High School", "Hernandez High School","Griffin High School"]
type_of_school = ["District", "District", "Charter", "District", "Charter"]

In [12]:
# Initialize a new DataFrame
schools_df = pd.DataFrame()

In [13]:
#Add the list to a new DataFrame.
schools_df["School ID"] = school_id

#Print the DataFrame
schools_df

   School ID
0          0
1          1
2          2
3          3
4          4

In [14]:
#Adding school name and type
high_schools_dicts = {'School ID': school_id, 'school_name': school_name, 'type': type_of_school}

In [15]:
high_schools_dicts = pd.Series(high_schools)
high_schools_dicts

0          Huan High School
1      Figueroa High School
2       Shelton High School
3     Hernandez High School
4       Griffin High School
5        Wilson High School
6       Cabrera High School
7        Bailey High School
8        Holden High School
9          Pena High School
10       Wright High School
11    Rodriguez High School
12      Johnson High School
13         Ford High School
14       Thomas High School
dtype: object

In [16]:
#To get the names of columns from columns index, values attributues in a Df use;
#<DataFrame_name>.columns # for ex to retrieve the columns attribute to the school_df
school_df.columns

Index(['School ID', 'school_name', 'type'], dtype='object')

In [17]:
#To get index of a DataFrame, use <DataFrame_name>.index
#running this produces output that consists of range index
# A RangeIndex contains 1st index value(startvalue), the last index value(stop value) 
#and the index increment value(step value)
#Means the index incremements by 1 from each index value to the next 
school_df.index

RangeIndex(start=0, stop=5, step=1)

In [18]:
#To get values of a Data Frame, use <DataFrame_name>.values
# To apply the index attribute to the school_df DataFrame, we use
school_df.values

array([[0, 'Huang High School', 'District'],
       [1, 'Figueroa High School', 'District'],
       [2, 'Shelton High School', 'Charter'],
       [3, 'Hernandez High School', 'District'],
       [4, 'Griffin High School', 'Charter']], dtype=object)

In [19]:
#create a list for each column,
#and add each list to a new Pandas DataFrame
school_id = [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14]

high_schools = ["Huang High School", "Figueroa High School",
               "Shelton High School", "Hernandez High School","Griffin High School", 
               "Wilson High School", "Cabrera High School", "Bailey High School", "Holden High School",
              "Pena High School", "Wright High School", "Rodriguez High School", "Johnson High School",
              "Ford High School", "Thomas High School"]
type_of_school = ["District", "District", "Charter", "District", "Charter", "Charter", "Charter",
                 "District", "Charter", "Charter", "Charter", "District", "District", "District",
                 "Charter"]

In [20]:
import pandas as pd

In [21]:
#Add each list to a new PandaDataFrame 
#For the code to create dataframe, use the pandas package
school_df = pd.DataFrame()

In [22]:
#we need to pass in some data for the dataframe, assuming you want to create 3 lists from the previous cell
high_schools_dict = {'School ID': school_id, 'school_name':high_schools, 'type':type_of_school}

In [23]:
#stores list to an object we can run
school_df = pd.DataFrame()
school_df['School ID'] = school_id
school_df['school_name'] = high_schools
school_df['type'] = type_of_school

In [24]:
school_df

    School ID            school_name      type
0           0      Huang High School  District
1           1   Figueroa High School  District
2           2    Shelton High School   Charter
3           3  Hernandez High School  District
4           4    Griffin High School   Charter
5           5     Wilson High School   Charter
6           6    Cabrera High School   Charter
7           7     Bailey High School  District
8           8     Holden High School   Charter
9           9       Pena High School   Charter
10         10     Wright High School   Charter
11         11  Rodriguez High School  District
12         12    Johnson High School  District
13         13       Ford High School  District
14         14     Thomas High School   Charter

In [25]:
import pandas as pd
import os

student_data = os.path.join("Resources/new_student_data.csv")
student_df = pd.read_csv(student_data)
student_df.head()

,student_id,student_name,grade,school_name,reading_score,math_score,school_type
0,127008367,Sarah Douglas,11th,Chang High School,87.2,64.1,Public
1,33365505,Francisco Osborne,9th,Fisher High School,NaN,NaN,Public
2,44359500,Ryan Haas,12th,Campbell High School,91.6,54.7,Public
3,24791243,Kathryn Mack,11th,Richard High School,68.9,73.3,Charter
4,121467881,Harold Reynolds,12th,Chang High School,68.7,43.4,Public

In [26]:
#Reviews single column for DataFrame
student_df["student_name"]

0            Sarah Douglas
1        Francisco Osborne
2                Ryan Haas
3             Kathryn Mack
4          Harold Reynolds
               ...
13935          Kelly Myers
13936       Kimberly Burke
13937      Crystal Merritt
13938        Misty Wiggins
13939        Michele Jones
Name: student_name, Length: 13940, dtype: object

In [27]:
#Just coding stuff - calculating number of missing values 
student_df.isnull().sum()

student_id          0
student_name        0
grade               0
school_name         0
reading_score    1414
math_score        705
school_type         0
dtype: int64

In [28]:
# Calculate the mean  to determine percentage of missing values like 20 rows of data`
student_df.isnull().mean()

student_id       0.000000
student_name     0.000000
grade            0.000000
school_name      0.000000
reading_score    0.101435
math_score       0.050574
school_type      0.000000
dtype: float64

In [29]:

import pandas as pd
import numpy as np

apple_df = pd.DataFrame({"AAPL": [72.27, np.nan, 74.39, np.nan, 75.94, 76.93,np.nan, 78.74, np.nan, 79.81, np.nan, 79.53, np.nan, 79.56, 79.49]})

apple_df.isnull().sum()

AAPL    6
dtype: int64

In [30]:
#Following imports Pandas and NumPy libraries then creates a daily_returns DataFrame with Apple/Google
#Stocks
import pandas as pd
import numpy as np
daily_returns = pd.DataFrame({
    "AAPL": [0.5, np.nan, 0.62],
    "GOOG": [0.45, 0.63, 0.55]
})
#clears the NA missing value and replaces it with a mean value using fillna and returns.mean()
daily_returns = daily_returns.fillna(daily_returns.mean())
daily_returns

   AAPL  GOOG
0  0.50  0.45
1  0.56  0.63
2  0.62  0.55

In [31]:
#We now call the dropna function which will produce output
daily_returns.dropna()

   AAPL  GOOG
0  0.50  0.45
1  0.56  0.63
2  0.62  0.55

In [32]:

# Replace the NaNs with "Unknown"
daily_returns = daily_returns.fillna("Unknown")

# Replace the NaNs with 0
daily_returns = daily_returns.fillna(0)

# Replace the NaNs with the mean of the column
daily_returns = daily_returns.fillna(daily_returns.mean())

In [33]:
# how to identify duplicate rows 
import pandas as pd
best_actors_df = pd.DataFrame({
        "Best Actors": ["Nic Cage", "Nic Cage", "Harrison Ford"]
})
best_actors_df

     Best Actors
0       Nic Cage
1       Nic Cage
2  Harrison Ford

In [34]:
best_actors_df.duplicated()
# To indicate duplicated entries, Pandas marks the first entry as False and any copies as True

0    False
1     True
2    False
dtype: bool

In [35]:
#To drop duplicate values 
best_actors_df = best_actors_df.drop_duplicates()
best_actors_df

     Best Actors
0       Nic Cage
2  Harrison Ford

In [36]:
#creates prices DataFrame with 3 values in the "prices_usd" columnm the first two values include a $
import pandas as pd
prices = pd.DataFrame({
    "price_usd": ["$0.53", "$0.22", "0.34"]
})
prices

  price_usd
0     $0.53
1     $0.22
2      0.34

In [37]:
#By using the dtypes function, we confirm the DataFrame elements that have a currency symbol
prices.dtypes
#object means three values in the "prices_usd" is a Python object.

price_usd    object
dtype: object

In [38]:
#Pandas object is the equivalent of a Python string which doesnt work in mathematical calculations
#need to convert to numerical data type by removing $ signs from text data and convering to numerical
#To remove $ use str.replace function to replace with an empty string rep'd by 2 quotations marks
# use loc or iloc and replace the string only in the column needed to be fixed 
#Replaces dollar signs with empty strings 
prices.loc[:, "price_usd"] = prices.loc[:, "price_usd"].str.replace("$", "")
prices

C:\Users\PC\anaconda3\envs\PythonData\lib\site-packages\ipykernel_launcher.py:6: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.

  price_usd
0      0.53
1      0.22
2      0.34

In [39]:
prices.dtypes

price_usd    object
dtype: object

In [40]:
#Removing currency symbols from data left us with string representations of our numbers
#Now we can use a Pandas function named astype to convert the strings to numbers 
#astype function accepts argument for numerical type that we want to convert the data to
#2 most common conversion arguments = float and int since datasets often deal with currencies we pick
#loc is used to specify column we wanna target
prices.loc[:, "prices_usd"] = prices.loc[:, "price_usd"].astype("float")
prices

  price_usd  prices_usd
0      0.53        0.53
1      0.22        0.22
2      0.34        0.34

In [41]:
prices.dtypes

price_usd      object
prices_usd    float64
dtype: object

In [42]:
import pandas as pd

In [43]:
# The DataFrame has five rows of produce sales data, To call describe function use 
sales_df = pd.DataFrame({"item": ["tomatoes", "onions", "potatoes", "tomatoes", "muhsrooms"],
                "quantity": [15, 26, 10, 12, 2],
                "total_price": [50.25, 39.52, 50.01, 40.20, 8.46]})
sales_df.head()

        item  quantity  total_price
0   tomatoes        15        50.25
1     onions        26        39.52
2   potatoes        10        50.01
3   tomatoes        12        40.20
4  muhsrooms         2         8.46

In [44]:
# to call describe use the following to show output of stats for each column
sales_df.describe()

        quantity  total_price
count   5.000000     5.000000
mean   13.000000    37.688000
std     8.717798    17.128761
min     2.000000     8.460000
25%    10.000000    39.520000
50%    12.000000    40.200000
75%    15.000000    50.010000
max    26.000000    50.250000

In [45]:
import pandas as pd

goog_df = pd.DataFrame({"AAPL": [1045.85, 1070.08, 1140.99, 1113.65, 1193.32, 1231.54, 1215.00, 1207.15,1248.84, 1166.27, 1138.85, 1003.63, 1080.91]})

goog_df

       AAPL
0   1045.85
1   1070.08
2   1140.99
3   1113.65
4   1193.32
5   1231.54
6   1215.00
7   1207.15
8   1248.84
9   1166.27
10  1138.85
11  1003.63
12  1080.91

In [46]:
#to find mean or average
goog_df.mean()

AAPL    1142.775385
dtype: float64

In [47]:
#to find max or highest value
goog_df.max()

AAPL    1248.84
dtype: float64

In [48]:
#finding standard deviation
goog_df.std()

AAPL    76.556568
dtype: float64

In [49]:
#number of elements in column
goog_df.count()

AAPL    13
dtype: int64

In [50]:
#finding min
goog_df.min()

AAPL    1003.63
dtype: float64

In [51]:
#min value of just the "total_proce column and stores the returned value of min_price
min_price = sales_df["total_price"].min()
min_price

8.46

In [52]:
sales_df.mean()

C:\Users\PC\anaconda3\envs\PythonData\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  """Entry point for launching an IPython kernel.

quantity       13.000
total_price    37.688
dtype: float64

In [53]:
sales_df.max()

item           tomatoes
quantity             26
total_price       50.25
dtype: object

In [54]:
import pandas as pd 
#Create a DataFrame 
aapl_returns = pd.DataFrame({"AAPL": [0.5, 0.56, 0.59, 0.52, 0.1]})

#Select the first row using iloc
aapl_returns.iloc[0]

AAPL    0.5
Name: 0, dtype: float64

In [57]:
#you could use list indexing to select the first item
import pandas as pd

aapl_returns = [0.5, 0.56, 0.59, 0.52, 0.1]
first_item = aapl_returns[0]
first_item

0.5

In [58]:
aapl_returns = pd.DataFrame({"AAPL": [0.5, 0.56, 0.59, 0.52, 0.1, 0.75, 0.47]})
#You can also use the Python list syntax with the Pandas iloc function to return a range of rows
#based on numerical index range like start"end range syntax that Python lists uses
aapl_returns.iloc[0:3]

   AAPL
0  0.50
1  0.56
2  0.59

In [59]:
#Select rows by index 
import numpy as np
revenue_df = pd.DataFrame(
    np.random.randint(low=1, high=1000, size=1000),
    index=pd.date_range('1/1/2017', periods=1000),
    columns=["revenue"])
revenue_df.tail()

            revenue
2019-09-23      385
2019-09-24      314
2019-09-25      906
2019-09-26      579
2019-09-27      243

In [60]:
#Select the last quarter of 2018 to the first quarter of 2019
revenue_df.loc['2018-10-01': '2019-03-31']

            revenue
2018-10-01      172
2018-10-02      889
2018-10-03       42
2018-10-04      308
2018-10-05      563
...             ...
2019-03-27      549
2019-03-28      360
2019-03-29       80
2019-03-30      717
2019-03-31      527

[182 rows x 1 columns]

In [61]:
#Describe the data by using summary statistics
revenue_df.loc['2018-10-01':'2019-03-31'].describe()

          revenue
count  182.000000
mean   496.510989
std    298.239878
min     15.000000
25%    223.750000
50%    510.000000
75%    758.500000
max    999.000000

In [62]:
#Created a sequential integer index so if we want to filter by item, we can use
#conditional statement that includes the column we want to filter by item or quantity
sales_df = pd.DataFrame({"item": ["tomatoes", "onions", "potatoes", "tomatoes", "mushrooms"],
                "quantity": [15, 26, 10, 12, 2],
                "total_price": [50.25, 39.52, 50.01, 40.20, 8.46]})
sales_df.head()

        item  quantity  total_price
0   tomatoes        15        50.25
1     onions        26        39.52
2   potatoes        10        50.01
3   tomatoes        12        40.20
4  mushrooms         2         8.46

In [63]:
#checking the quantity so that every row greater than 10 will be marked by true
filter = sales_df["quantity"] > 10

In [64]:
#passing boolean values to the loc function
sales_df.loc[filter]

       item  quantity  total_price
0  tomatoes        15        50.25
1    onions        26        39.52
3  tomatoes        12        40.20

In [65]:
#OR we can write it like this 
sales_df.loc[sales_df["quantity"] > 10]

       item  quantity  total_price
0  tomatoes        15        50.25
1    onions        26        39.52
3  tomatoes        12        40.20

In [66]:
#You can select rows that combining filters 
#where two conditions are true we use the AND operator which is ampersand (&)
#to select rows where either of two conditions are true use OR operator which is pipe(| or \)
sales_df = pd.DataFrame({"item": ["tomatoes", "onions", "potatoes", "tomatoes", "mushrooms"],
                "quantity": [15, 26, 10, 12, 2],
                "total_price": [50.25, 39.52, 50.01, 40.20, 8.46]})

In [68]:
#The following code selects the rows where the quantity is greater than 10 and the total price is <45

{.language-python}sales_df.loc[(sales_df["quantity"]>10)&(sales_df["total_price"]<45)]

SyntaxError: invalid syntax (400924624.py, line 3)

In [ ]:
#A screenshot that depicts rows 1 and 3 where either one or both is are true
{.language-python}sales_df.loc[(sales_df["quantity"]>10)|(sales_df["total_price"]<45)]

In [70]:
#finding min price row
{.language-python} min_price = sales_df["total_price"].min() min_price_row = sales_df.loc[sales_df["total_price"] == min_price] min_price_row

SyntaxError: invalid syntax (4026721470.py, line 2)

In [ ]:
# average of the total prices in the two rows 
{.language-python}sales_df.loc[sales_df["item"] == "tomatoes", ["total_price"]].mean()

In [71]:
#Selecting columns and filters rows
{.language-python}sales_df.iloc[0:3, [0, 2]]

SyntaxError: invalid syntax (2495734569.py, line 2)

In [ ]:
# output consists of quantity and total_price columns for any rows that include tomatoes in the items 
{.language-python} sales_df.loc[sales_df["item"] == "tomatoes", ["quantity", "total_price"]]

In [ ]:
# output displays stated columns
{.language-python} sales_df.loc[:, ["item", "total_price"]]

In [ ]:
#output shows values that are in ascending order
{.language-python} sales_df.sort_values("total_price")

In [ ]:
#output shows values in descending order 
{.language-python} sales_df.sort_values("total_price", ascending=False)

In [72]:
#Using groupby function to automatically subdivide a DataFrame into groups based on a column in the Data
    "item": ["tomatoes", "onions", "potatoes", "tomatoes", "mushrooms", "potatoes", "onions", "tomatoes", "onions","tomatoes"],
    "store":["Downtown", "Downtown", "Midtown", "Midtown", "Downtown", "Midtown", "Downtown", "Midtown", "Midtown", "Midtown"],
    "quantity": [15, 26, 10, 12, 2, 3, 17, 16, 20, 9],
    "total_price": [50.25, 39.52, 50.10, 40.20, 8.46, 15.03, 25.84, 53.60, 30.40, 30.15]})
sales_df

        item     store  quantity  total_price
0   tomatoes  Downtown        15        50.25
1     onions  Downtown        26        39.52
2   potatoes   Midtown        10        50.10
3   tomatoes   Midtown        12        40.20
4  mushrooms  Downtown         2         8.46
5   potatoes   Midtown         3        15.03
6     onions  Downtown        17        25.84
7   tomatoes   Midtown        16        53.60
8     onions   Midtown        20        30.40
9   tomatoes   Midtown         9        30.15

In [75]:
# we must find a column with repeated values to use groupby so we can group them like the "item" column
item_group_df = sales_df.groupby("item")
item_group_df.mean

In [ ]:
#The output is a string of characters that has no obvious meaning! 
#That’s because the groups are packed together, waiting for a Pandas aggregation 
#function to display the data. We use these aggregation functions to be able to compare the groups.

In [76]:
#we need to use a Pandas aggregation function. The 
#aggregation functions are functions that each return a single value when applied to an entire column.
#sum adds all the values together to return a single value, while max finds and returns only the largest
#Using mean on our grouped sales data 
item_group_df = sales_df.groupby("item")
item_group_df.mean()

           quantity  total_price
item
mushrooms       2.0        8.460
onions         21.0       31.920
potatoes        6.5       32.565
tomatoes       13.0       43.550

In [77]:
#We can group multiple columns at the same time;rows are grouped by store then item 
store_item_group_df = sales_df.groupby(["store", "item"])
store_item_group_df.max()

                    quantity  total_price
store    item
Downtown mushrooms         2         8.46
         onions           26        39.52
         tomatoes         15        50.25
Midtown  onions           20        30.40
         potatoes         10        50.10
         tomatoes         16        53.60